docs/examples/ship v21/Ground HomeDelivery Shipment - Appointment.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v21="http://fedex.com/ws/ship/v21">
   <soapenv:Header/>
   <soapenv:Body>
      <v21:ProcessShipmentRequest>
         <v21:WebAuthenticationDetail>
            <v21:ParentCredential>
               <v21:Key>INPUT YOUR INFORMATION</v21:Key>
               <v21:Password>INPUT YOUR INFORMATION</v21:Password>
            </v21:ParentCredential>
            <v21:UserCredential>
               <v21:Key>INPUT YOUR INFORMATION</v21:Key>
               <v21:Password>INPUT YOUR INFORMATION</v21:Password>
            </v21:UserCredential>
         </v21:WebAuthenticationDetail>
         <v21:ClientDetail>
            <v21:AccountNumber>INPUT YOUR INFORMATION</v21:AccountNumber>
            <v21:MeterNumber>INPUT YOUR INFORMATION</v21:MeterNumber>
         </v21:ClientDetail>
         <v21:TransactionDetail>
            <v21:CustomerTransactionId>Ship_International_basic</v21:CustomerTransactionId>
         </v21:TransactionDetail>
         <v21:Version>
            <v21:ServiceId>ship</v21:ServiceId>
            <v21:Major>21</v21:Major>
            <v21:Intermediate>0</v21:Intermediate>
            <v21:Minor>0</v21:Minor>
         </v21:Version>
         <v21:RequestedShipment>
            <v21:ShipTimestamp>${=String.format('%tF', new Date())}T12:34:56-06:00</v21:ShipTimestamp>
            <v21:DropoffType>REGULAR_PICKUP</v21:DropoffType>
            <v21:ServiceType>GROUND_HOME_DELIVERY</v21:ServiceType>
            <v21:PackagingType>YOUR_PACKAGING</v21:PackagingType>
            <v21:Shipper>
               <v21:AccountNumber>150067600</v21:AccountNumber>
               <v21:Contact>
                  <v21:PersonName>INPUT YOUR INFORMATION</v21:PersonName>
                  <v21:CompanyName>Syntel</v21:CompanyName>
                  <v21:PhoneNumber>INPUT YOUR INFORMATION</v21:PhoneNumber>
                  <v21:EMailAddress>abhay_palaskar@syntelinc.com</v21:EMailAddress>
               </v21:Contact>
               <v21:Address>
                  <v21:StreetLines>INPUT YOUR INFORMATION</v21:StreetLines>
                  <v21:City>MEMPHIS</v21:City>
                  <v21:StateOrProvinceCode>TN</v21:StateOrProvinceCode>
                  <v21:PostalCode>38117</v21:PostalCode>
                  <v21:CountryCode>US</v21:CountryCode>
                  <v21:Residential>1</v21:Residential>
               </v21:Address>
            </v21:Shipper>
            <v21:Recipient>
               <v21:AccountNumber>INPUT YOUR INFORMATION</v21:AccountNumber>
               <v21:Contact>
                  <v21:PersonName>INPUT YOUR INFORMATION</v21:PersonName>
                  <v21:CompanyName>Syntel</v21:CompanyName>
                  <v21:PhoneNumber>INPUT YOUR INFORMATION</v21:PhoneNumber>
                  <v21:EMailAddress>abhay_palaskar@syntelinc.com</v21:EMailAddress>
               </v21:Contact>
               <v21:Address>
                  <v21:StreetLines>Recipient Address Line 1</v21:StreetLines>
                  <v21:StreetLines>Recipient Address Line 2</v21:StreetLines>
                  <v21:City>Collierville</v21:City>
                  <v21:StateOrProvinceCode>TN</v21:StateOrProvinceCode>
                  <v21:PostalCode>38017</v21:PostalCode>
                  <v21:CountryCode>US</v21:CountryCode>
                  <v21:Residential>1</v21:Residential>
               </v21:Address>
            </v21:Recipient>
            <v21:ShippingChargesPayment>
               <v21:PaymentType>SENDER</v21:PaymentType>
               <v21:Payor>
                  <v21:ResponsibleParty>
                     <v21:AccountNumber>INPUT YOUR INFORMATION</v21:AccountNumber>
                     <v21:Contact>
                        <v21:PersonName>Abhay_Recipient</v21:PersonName>
                        <v21:EMailAddress>abhay_palaskar@syntelinc.com</v21:EMailAddress>
                     </v21:Contact>
                  </v21:ResponsibleParty>
               </v21:Payor>
            </v21:ShippingChargesPayment>
            <v21:LabelSpecification>
               <v21:LabelFormatType>COMMON2D</v21:LabelFormatType>
               <v21:ImageType>PNG</v21:ImageType>
            </v21:LabelSpecification>
            <v21:RateRequestTypes>LIST</v21:RateRequestTypes>
            <v21:PackageCount>1</v21:PackageCount>
            <v21:RequestedPackageLineItems>
               <v21:SequenceNumber>1</v21:SequenceNumber>
               <v21:Weight>
                  <v21:Units>LB</v21:Units>
                  <v21:Value>40</v21:Value>
               </v21:Weight>
               <v21:Dimensions>
                  <v21:Length>5</v21:Length>
                  <v21:Width>5</v21:Width>
                  <v21:Height>5</v21:Height>
                  <v21:Units>IN</v21:Units>
               </v21:Dimensions>
               <v21:PhysicalPackaging>BAG</v21:PhysicalPackaging>
               <v21:ItemDescription>Book</v21:ItemDescription>
               <v21:CustomerReferences>
                  <v21:CustomerReferenceType>CUSTOMER_REFERENCE</v21:CustomerReferenceType>
                  <v21:Value>NAFTA_COO</v21:Value>
               </v21:CustomerReferences>
               <v21:SpecialServicesRequested>
                  <v21:SpecialServiceTypes>APPOINTMENT_DELIVERY</v21:SpecialServiceTypes>
               </v21:SpecialServicesRequested>
            </v21:RequestedPackageLineItems>
         </v21:RequestedShipment>
      </v21:ProcessShipmentRequest>
   </soapenv:Body>
</soapenv:Envelope>

Reply:
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
   <SOAP-ENV:Header/>
   <SOAP-ENV:Body>
      <ProcessShipmentReply xmlns="http://fedex.com/ws/ship/v21">
         <HighestSeverity>ERROR</HighestSeverity>
         <Notifications>
            <Severity>ERROR</Severity>
            <Source>ship</Source>
            <Code>8343</Code>
            <Message>Package 1 - Appointment Delivery is not allowed with the service selected.</Message>
            <LocalizedMessage>Package 1 - Appointment Delivery is not allowed with the service selected.</LocalizedMessage>
            <MessageParameters>
               <Id>PACKAGE_INDEX</Id>
               <Value>1</Value>
            </MessageParameters>
         </Notifications>
         <TransactionDetail>
            <CustomerTransactionId>Ship_International_basic</CustomerTransactionId>
         </TransactionDetail>
         <Version>
            <ServiceId>ship</ServiceId>
            <Major>21</Major>
            <Intermediate>0</Intermediate>
            <Minor>0</Minor>
         </Version>
      </ProcessShipmentReply>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>